; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v5 ?v10)
             (pred_1 ?v9 ?v11)
             (pred_8 ?v5 ?v11)
             (pred_10 ?v4 ?v5 )
	     (pred_12 ?v5)
             (pred_7 ?v12)
             (pred_5 ?v9)
             (pred_3 ?v11)
             (pred_2 ?v5)
             (pred_9 ?v9)
             (pred_6 ?v5)
             (pred_11 ))



(:action op_1
:parameters (?v3 ?v6 ?v2 ?v7)
:precondition (and (pred_7 ?v3) (pred_7 ?v6) (pred_5 ?v2) (pred_3 ?v7)
          (pred_4 ?v3 ?v6) (pred_1 ?v2 ?v7)
                   (pred_8 ?v6 ?v7) (pred_12 ?v3) 
                   (pred_2 ?v6) (pred_9 ?v2))
:effect (and  (pred_6 ?v6) (not (pred_2 ?v6))))


(:action op_3
:parameters (?v3 ?v1)
:precondition (and (pred_7 ?v3) (pred_7 ?v1)
               (pred_12 ?v3) (pred_4 ?v3 ?v1) (pred_6 ?v1))
:effect (and (pred_12 ?v1) (not (pred_12 ?v3))))

(:action op_2
:parameters (?v3 ?v2)
:precondition (and (pred_7 ?v3) (pred_5 ?v2) 
                  (pred_12 ?v3) (pred_10 ?v2 ?v3) (pred_11 ))
:effect (and (pred_9 ?v2)
   (not (pred_10 ?v2 ?v3)) (not (pred_11 ))))


(:action op_5
:parameters (?v3 ?v13 ?v8)
:precondition (and (pred_7 ?v3) (pred_5 ?v13) (pred_5 ?v8)
                  (pred_12 ?v3) (pred_9 ?v8) (pred_10 ?v13 ?v3))
:effect (and (pred_9 ?v13) (pred_10 ?v8 ?v3)
        (not (pred_9 ?v8)) (not (pred_10 ?v13 ?v3))))

(:action op_4
:parameters (?v3 ?v2)
:precondition (and (pred_7 ?v3) (pred_5 ?v2) 
                  (pred_12 ?v3) (pred_9 ?v2))
:effect (and (pred_11 ) (pred_10 ?v2 ?v3) (not (pred_9 ?v2)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_18 obj_02 obj_12 obj_07 obj_20 obj_16 obj_09 obj_05 obj_08 obj_11 obj_19 obj_17 obj_03 obj_10 obj_15
    obj_22 obj_06 obj_04
    obj_13 obj_14 obj_21
    )

    (:init
       (pred_11)

       (pred_7 obj_01)
       (pred_7 obj_18)
       (pred_7 obj_02)
       (pred_7 obj_12)
       (pred_7 obj_07)
       (pred_7 obj_20)
       (pred_7 obj_16)
       (pred_7 obj_09)
       (pred_7 obj_05)
       (pred_7 obj_08)
       (pred_7 obj_11)
       (pred_7 obj_19)
       (pred_7 obj_17)
       (pred_7 obj_03)
       (pred_7 obj_10)
       (pred_7 obj_15)
       (pred_3 obj_22)
       (pred_3 obj_06)
       (pred_3 obj_04)
       (pred_5 obj_13)
       (pred_5 obj_14)
       (pred_5 obj_21)

       (pred_4 obj_01 obj_07)
       (pred_4 obj_01 obj_18)
       (pred_4 obj_18 obj_20)
       (pred_4 obj_18 obj_02)
       (pred_4 obj_18 obj_01)
       (pred_4 obj_02 obj_16)
       (pred_4 obj_02 obj_12)
       (pred_4 obj_02 obj_18)
       (pred_4 obj_12 obj_09)
       (pred_4 obj_12 obj_02)
       (pred_4 obj_07 obj_05)
       (pred_4 obj_07 obj_20)
       (pred_4 obj_07 obj_01)
       (pred_4 obj_20 obj_08)
       (pred_4 obj_20 obj_16)
       (pred_4 obj_20 obj_18)
       (pred_4 obj_20 obj_07)
       (pred_4 obj_16 obj_11)
       (pred_4 obj_16 obj_09)
       (pred_4 obj_16 obj_02)
       (pred_4 obj_16 obj_20)
       (pred_4 obj_09 obj_19)
       (pred_4 obj_09 obj_12)
       (pred_4 obj_09 obj_16)
       (pred_4 obj_05 obj_17)
       (pred_4 obj_05 obj_08)
       (pred_4 obj_05 obj_07)
       (pred_4 obj_08 obj_03)
       (pred_4 obj_08 obj_11)
       (pred_4 obj_08 obj_20)
       (pred_4 obj_08 obj_05)
       (pred_4 obj_11 obj_10)
       (pred_4 obj_11 obj_19)
       (pred_4 obj_11 obj_16)
       (pred_4 obj_11 obj_08)
       (pred_4 obj_19 obj_15)
       (pred_4 obj_19 obj_09)
       (pred_4 obj_19 obj_11)
       (pred_4 obj_17 obj_03)
       (pred_4 obj_17 obj_05)
       (pred_4 obj_03 obj_10)
       (pred_4 obj_03 obj_08)
       (pred_4 obj_03 obj_17)
       (pred_4 obj_10 obj_15)
       (pred_4 obj_10 obj_11)
       (pred_4 obj_10 obj_03)
       (pred_4 obj_15 obj_19)
       (pred_4 obj_15 obj_10)
       (pred_2 obj_15)
       (pred_2 obj_08)
       (pred_2 obj_11)
       (pred_8  obj_15 obj_22)
       (pred_8  obj_08 obj_06)
       (pred_8  obj_11 obj_04)
       (pred_6 obj_01)
       (pred_6 obj_18)
       (pred_6 obj_02)
       (pred_6 obj_12)
       (pred_6 obj_07)
       (pred_6 obj_20)
       (pred_6 obj_16)
       (pred_6 obj_09)
       (pred_6 obj_05)
       (pred_6 obj_19)
       (pred_6 obj_17)
       (pred_6 obj_03)
       (pred_6 obj_10)

       (pred_1  obj_13 obj_22)
       (pred_1  obj_14 obj_06)
       (pred_1  obj_21 obj_04)
       (pred_10 obj_13 obj_09)
       (pred_10 obj_14 obj_20)
       (pred_10 obj_21 obj_03)
       (pred_12 obj_19)
    )

    (:goal (and
       (pred_10 obj_13 obj_05)
    ))
(:constraints
  (always (not (pred_12 obj_16)))
)
)

; plan
1. (op_3 obj_19 obj_09)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_09)
   goals met: 0 of 1
2. (op_2 obj_09 obj_13)
   deleted: (pred_10 obj_13 obj_09) (pred_11)
   added: (pred_9 obj_13)
   goals met: 0 of 1
3. (op_3 obj_09 obj_12)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_12)
   goals met: 0 of 1
4. (op_3 obj_12 obj_02)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_02)
   goals met: 0 of 1
5. (op_3 obj_02 obj_18)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_18)
   goals met: 0 of 1
6. (op_3 obj_18 obj_01)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_01)
   goals met: 0 of 1
7. (op_3 obj_01 obj_07)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_07)
   goals met: 0 of 1
8. (op_3 obj_07 obj_05)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_05)
   goals met: 0 of 1
9. (op_4 obj_05 obj_13)
   deleted: (pred_9 obj_13)
   added: (pred_11) (pred_10 obj_13 obj_05)
   goals met: 1 of 1
